Tekla Open API Reference for Tekla Structures 2025
Localization.Util.PropertyLocalizer Class
 The PropertyLocalizer class localizes properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.Localization.Util.PropertyLocalizer
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PropertyLocalizer
Public Class PropertyLocalizer
The Localization.Util.PropertyLocalizer type exposes the following members.
Constructors
Name | Description
Localization.Util.PropertyLocalizer
 Creates a new instance of the localizer.
Top
Methods
Name | Description
Localize
 Localizes the object with the given localization instance.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace